// pages/news/detail/detail.js
const app = getApp();
Page({

  /**
   * 页面的初始数据
   */
  data: {
    id:'',  // 定义文字编号
    article: {

    },
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    let id = options.id - 1;
    // 接收用户传递的文字编号
    let news = [
      {
        id:1,
        title:'小米集团2020全年财报正式',
        data:'2021-6-1',
        intro:`作为一位经营民宿的房东，搁两年前，我都不会想到，有一天我竟会为选购室外摄像头而烦恼到上网发帖求助。有一说一，随着疫情情况的减缓，旅游业的复苏，越来越多的游客涌向了民宿，这也就意味着，小店重新变得人来人往，大大小小的行李也重新堆满了前台。为什么我会为这事着急？这款小米室外摄像机 电池版是我自己刷手机看到的，它的无线、随意装、不怕逆光这些特点，直接将我种草，买回来送给哥们就两个字——真香。这款小米室外摄像机 电池版是我自己刷手机看到的，它的无线、随意装、不怕逆光这些特点，直接将我种草，买回来送给哥们就两个字——真香。哥们儿家的摄像头掉下来之后，电线直接裸露出来，丑不说，还很危险。这种问题在小米室外摄像机身上就不会出现，因为它真正做到了无线安装，独立机身设计，无需排线布线。我也想过，与其担心室外安装布线扰乱装修风格，我更在意的是，安装的位置和安装是否方便。小米室外摄像机直接满足我需求，作为小米首款室外无线摄像机，它的安装方便，无需布线，想安哪里安哪里，美观大方，不影响整体装修风格。白色的机体更是“百搭”和我们民宿的外墙风格十分匹配。民宿的院子里为了多接收客人，我们一般会常年大门敞开，这样有预约的客人会直接开车进来。这一特点也增加了看家护院的特别需求，能把整个院子都照全，是最基本的要求——没有想到的是，小米室外摄像机130°大广角不光照到了院里的每个角落，就连我们院子外墙的树木绿植都能涵盖，相同距离拍摄更大画面，一个摄像头能搞定的事儿，绝不用第二个。相对于海景房哥们儿的海边日落日升，我家位于山涧的民宿小院，在下午日落时，更是会面对山坳间照射而来的阳光的全面围剿。一般的摄像头面对这阵仗，早就一片泛白，什么也拍不清楚了。小米室外摄像机什么光照条件下都能搞得定，都能看得清，无论逆光暗光，全都照单全收。冬天天黑得早，5点钟太阳就落山了，挺过了日落的考验，黑暗之下，摄像机也能拍出十分清晰的画质，你黑任你黑，我有小米室外摄像机。同等价位下，这款摄像机的清晰度完全碾压同价位产品，性价比超高。`,
        hits:'256',
        img:app.StoragePath + '/img/class/readmiPhone/readmiK/1.png'
      },
      {
        id:2,
        title:'#小米618#全平台支付突破30亿！',
        data:'2021-6-1',
        intro:`根据小米618开门红战报：用时仅3分50秒，小米618开门红全平台支付金额突破5亿元；截至00:17:10，小米618开门红全平台支付金额突破10亿元；截至00:49:52，小米618开门红全平台支付金额突破15亿元。`,
        hits:'256',
        img:app.StoragePath + '/img/class/readmiPhone/readmiK/2.png'
      },
      {
        id:3,
        title:'你期待Note10搭配那颗真芯',
        data:'2021-6-1',
        intro:`5月21日消息，小米集团中国区总裁、Redmi品牌总经理卢伟冰揭开了Redmi Note 10系列的神秘面纱。
        海报显示，Redmi Note 10系列的slogan是“我把真芯献给你”，表明Redmi Note 10系列使用的是旗舰处理器。
        小米公司Redmi产品总监王腾指出，旗舰机上关于性能过剩的讨论很多，对于中端机来说，整体性能还停留在2-3年前旗舰机水平，这次Note 10系列势必捅破中端机性能天花板。
        目前关于Redmi Note 10系列的芯片细节暂时不得而知，有消息称它使用的是联发科天玑1100旗舰处理器，也有猜测Redmi Note 10系列使用天玑700芯片。
        按照以往Redmi Note系列的产品布局，Pro版本或者高配版本使用高端芯片，标准版预计使用中端芯片。
        不出意外，Redmi Note 10系列将是Redmi新一代爆款神机。`,
        hits:'256',
        img:app.StoragePath + '/img/class/readmiPhone/readmiK/3.png'
      },
      {
        id:4,
        title:'小米AIoT路由器AX6000亮相4',
        data:'2021-6-1',
        intro:`小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4`,
        hits:'256',
      },
      {
        id:5,
        title:'小米AIoT路由器AX6000亮相5',
        data:'2021-6-1',
        intro:`小米AIoT路由器AX6000亮相5小米AIoT路由器AX6000亮相5小米AIoT路由器AX6000亮相5小米AIoT路由器AX6000亮相5小米AIoT路由器AX6000亮相5`,
        hits:'256',
      },
      {
        id:6,
        title:'小米AIoT路由器AX6000亮相6',
        data:'2021-6-1',
        intro:`小米AIoT路由器AX6000亮相6小米AIoT路由器AX6000亮相6小米AIoT路由器AX6000亮相6小米AIoT路由器AX6000亮相6小米AIoT路由器AX6000亮相6小米AIoT路由器AX6000亮相6`,
        hits:'256',
      },
      {
        id:7,
        title:'小米AIoT路由器AX6000亮相7',
        data:'2021-6-1',
        intro:`小米AIoT路由器AX6000亮相7小米AIoT路由器AX6000亮相7小米AIoT路由器AX6000亮相7小米AIoT路由器AX6000亮相7小米AIoT路由器AX6000亮相7小米AIoT路由器AX6000亮相7`,
        hits:'256',
      },
      {
        id:8,
        title:'小米AIoT路由器AX6000亮相8',
        data:'2021-6-1',
        intro:`小米AIoT路由器AX6000亮相8小米AIoT路由器AX6000亮相8小米AIoT路由器AX6000亮相8小米AIoT路由器AX6000亮相8小米AIoT路由器AX6000亮相8`,
        hits:'256',
      },
      {
        id:9,
        title:'小米AIoT路由器AX6000亮相4',
        data:'2021-6-1',
        intro:`小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4小米AIoT路由器AX6000亮相4`,
        hits:'256',
      },
    ]
    
    if(true) {
      this.setData({article:news[id]})
    }
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})